app/controllers/albums_controller.rb

SELECT "albums".* FROM "albums"
---
  def index
    respond_with @albums = current_user.albums.page(params[:page]).per(8)