app/controllers/users_controller.rb

INSERT INTO "users" ("auth_token", "created_at", "email", "first_name", "last_login", "last_name", "login_count", "password_digest", "password_reset_sent_at", "password_reset_token", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @user = User.new params[:user]

    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
---
  def edit
    respond_with @user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "users" SET "password_digest" = '$2a$10$WUyPQ.P8R.ZWBOPxs6A0LeAstboZeVJ.d.mmD7UlZM1.vq.LoiYIi', "updated_at" = '2013-07-24 01:52:29.205379' WHERE "users"."id" = 2
---
  def update
    @user = User.find params[:id]


    if @user.update_attributes(params[:user])